In [48]:
#importar bibliotecas pandas
import pandas as pd
import numpy as np

In [49]:
#series
s = pd.Series(np.array([1,2,3,4,5]))

In [50]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [51]:
#com index
se = pd.Series(np.array(['001','002','003','004','005','006']), index=[1,2,3,4,5,6])
se

1    001
2    002
3    003
4    004
5    005
6    006
dtype: object

In [54]:
#lendo CSV
df = pd.read_csv(('drogs.csv'), delimiter= ',')

In [55]:
df

     IDADE     SEXO_t      BP COLESTEROL       Na_to_K   DROGAS
0       23  Masculino    HIGH       HIGH        25.355  Cocaina
1       47   Feminino     LOW       HIGH        13.093  Maconha
2       47   Feminino     LOW       HIGH        10.114  Maconha
3       28  Masculino  NORMAL       HIGH         7.798      LDS
4       61  Masculino     LOW       HIGH        18.043  Cocaina
..     ...        ...     ...        ...           ...      ...
195     56  Masculino     LOW       HIGH        11.567  Maconha
196     16   Feminino     LOW       HIGH  1Masculino06  Maconha
197     52   Feminino  NORMAL       HIGH         9.894      LDS
198     23   Feminino  NORMAL     NORMAL         14.02      LDS
199     40  Masculino     LOW     NORMAL        11.349      LDS

[200 rows x 6 columns]

In [56]:
#passa pelas linhas 
df.head(10)

   IDADE     SEXO_t      BP COLESTEROL      Na_to_K   DROGAS
0     23  Masculino    HIGH       HIGH       25.355  Cocaina
1     47   Feminino     LOW       HIGH       13.093  Maconha
2     47   Feminino     LOW       HIGH       10.114  Maconha
3     28  Masculino  NORMAL       HIGH        7.798      LDS
4     61  Masculino     LOW       HIGH       18.043  Cocaina
5     22  Masculino  NORMAL       HIGH        8.607      LDS
6     49  Masculino  NORMAL       HIGH       16.275  Cocaina
7     41   Feminino     LOW       HIGH  1Feminino37  Maconha
8     60   Feminino  NORMAL       HIGH       15.171  Cocaina
9     43   Feminino     LOW     NORMAL       19.368  Cocaina

In [57]:
df.tail

<bound method NDFrame.tail of      IDADE     SEXO_t      BP COLESTEROL       Na_to_K   DROGAS
0       23  Masculino    HIGH       HIGH        25.355  Cocaina
1       47   Feminino     LOW       HIGH        13.093  Maconha
2       47   Feminino     LOW       HIGH        10.114  Maconha
3       28  Masculino  NORMAL       HIGH         7.798      LDS
4       61  Masculino     LOW       HIGH        18.043  Cocaina
..     ...        ...     ...        ...           ...      ...
195     56  Masculino     LOW       HIGH        11.567  Maconha
196     16   Feminino     LOW       HIGH  1Masculino06  Maconha
197     52   Feminino  NORMAL       HIGH         9.894      LDS
198     23   Feminino  NORMAL     NORMAL         14.02      LDS
199     40  Masculino     LOW     NORMAL        11.349      LDS

[200 rows x 6 columns]>

In [58]:
df.columns

Index(['IDADE', 'SEXO_t', 'BP', 'COLESTEROL', 'Na_to_K', 'DROGAS'], dtype='object')

In [62]:
tst = df[["SEXO","BP","COLESTEROL"]]
tst

        SEXO_t      BP COLESTEROL
0    Masculino    HIGH       HIGH
1     Feminino     LOW       HIGH
2     Feminino     LOW       HIGH
3    Masculino  NORMAL       HIGH
4    Masculino     LOW       HIGH
..         ...     ...        ...
195  Masculino     LOW       HIGH
196   Feminino     LOW       HIGH
197   Feminino  NORMAL       HIGH
198   Feminino  NORMAL     NORMAL
199  Masculino     LOW     NORMAL

[200 rows x 3 columns]

In [63]:
df.SEXO_t.value_counts()

Feminino     104
Masculino     96
Name: SEXO_t, dtype: int64